Documents/роЗаказНаряд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>роЗаказНаряд</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РаботаРО</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОборудования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>33</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>33</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИспытания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеБрака</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Испытатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контролер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыявленныеДефекты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Дефекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Примечания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПримечаниеСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>77</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заключение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Заключения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАктаДопОбр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДопОбр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДопОбр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовленияДопОбр</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиаметрДопОбр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДавлениеДопОбр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПримечаниеДопОбр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДопОбр</Name>
					<Comment>0 - Нет; 1- Лубрикатор; 2 - задвижка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСкладаR3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПунктыПогрузки</v8:Type>
						<v8:Type>cfg:CatalogRef.ро_ИдентификаторСкладаЗаказчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТТНвходящий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>33</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокСтатус</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогСТК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокОтгрузки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ро_Отгрузка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогОтгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПоступление</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ро_ПриходОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассГерметичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОборудованиеПримечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>масса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАктаДопОбр1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДопОбр1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДопОбр1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовленияДопОбр1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиаметрДопОбр1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДавлениеДопОбр1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПримечаниеДопОбр1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключитьВРеестр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОборудованияКор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>33</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвНомерКор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>33</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПружины</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Пружины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановочноеДавление</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОборудованиеКор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Дефектовка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Деталь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДеталиОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дефект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Дефекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Годен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реставрация</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изготовление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Покупка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ПечатныеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ПечатныеФормы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>хрОбработкаПечати</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>333</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФильтрЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаФильтра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>222</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗнФильтра</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФормыПоКонтрагентам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>хрОбработкаПечати</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайлаОбработки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>333</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лог</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/роЗаказНаряд/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем СсылкаДефектГоден;

&НаСервереБезКонтекста
Функция РодителиОбр(ТекОбр)
	
	Стк = новый Структура("Род1,Род2");
	Если ЗначениеЗаполнено(ТекОбр.Родитель) = Ложь ТОгда Возврат Стк; КонецЕСЛИ;
	Стк.Род1 = ТекОбр.Родитель; 
	Стк.Род2 = Стк.Род1.Родитель; 
	//п = ТекОбр.Родитель.ПолноеНаименование(); 
	//П = СтрЗаменить(п,"/",Символы.ПС);
	
	Возврат Стк;
	
КонецФункции

&НаСервере
Процедура ОборудованиеПриИзмененииНаСервере()
	Справочники.ПечатныеФормы.ДобавитьКнопкиПечати(ЭтаФорма,Объект.Оборудование,,,Объект.Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму(Элемент=Неопределено)
	
	пОбр = Объект.Оборудование;
	Если ЗначениеЗаполнено(Объект.ОборудованиеКор) Тогда
		пОбр = Объект.ОборудованиеКор;
	КонецЕсли;
	
	СткРод = РодителиОбр(пОбр);
	оборудованиеРод1 = СткРод.род1;
	оборудованиеРод2 = СткРод.род2;
	
	Если Объект.ВидДопОбр = 1 Тогда
		Элементы.стрДопОбр.Видимость=Истина;
		Элементы.стрДопОбр.Заголовок="Доп.оборудование: Лубрикатор";
	ИНачеЕсли Объект.ВидДопОбр = 2 Тогда
		Элементы.стрДопОбр.Видимость=Истина;
		Элементы.стрДопОбр.Заголовок="Доп.оборудование: Задвижка";

	Иначе
		Элементы.стрДопОбр.Видимость=Ложь;
	КонецЕСлИ;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьФорму();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПечатьКарточкиНаСервере(сс)
	// Вставить содержимое обработчика.
	Возврат Документы.роЗаказНаряд.ПечатьКарточки(сс);
КонецФункции

&НаКлиенте
Процедура ПечатьКарточки(Команда)
	Таб = ПечатьКарточкиНаСервере(Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.ФормаПечати",Новый Структура("Результат,Заголовок",Таб,"Карточки"),,Новый УникальныйИдентификатор());

	//Таб.Показать();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка)=ЛОжь Тогда
		Объект.Статус = Справочники.ро_Статусы.ВРаботе;
	КонецЕсли;
	ОборудованиеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСткПодписантов(ссОбр)
	
	Стк = Новый Структура;
	
	эл = Справочники.ПечатныеФормы.НайтиЭлементСПечФормами(ссОбр);
	Тбл = эл.Подписи.выгрузить();
	ном = 0;
	ДЛя каждого Стр из Тбл Цикл
		ном = Ном +1;
		Стк.вставить("Подписант"+ном,Стр.ФизЛицо);
	КонецЦикла;
	
	Возврат Стк;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПодписантовСТК()
	Стк = ПолучитьСткПодписантов(Объект.Оборудование);
	
	Если Стк.свойство("Подписант1")=Истина Тогда
		Стк.свойство("Подписант1",Объект.Испытатель);
	КонецЕСЛИ;
	Если Стк.свойство("Подписант2")=Истина Тогда
		Стк.свойство("Подписант2",Объект.Мастер);
	КонецЕСЛИ;
	Если Стк.свойство("Подписант3")=Истина Тогда
		Стк.свойство("Подписант3",Объект.Контролер);
	КонецЕСЛИ;
	
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеПриИзменении(Элемент)
	ОборудованиеПриИзмененииНаСервере();
	ЗаполнитьПодписантовСТК();
	ОбновитьФорму();
КонецПроцедуры

&НасервереБезКонтекста
Функция ПечатныеФормыНаСервере(ссДок,Имя,Контрагент)
	Если ЗначениеЗаполнено(ссДОк)=Ложь Тогда Возврат Неопределено; КонецЕсли; 
	
		Возврат Справочники.ПечатныеФормы.ПечатьПоКодуФормы(ссДок,Имя,Контрагент);
	
КонецФункции

&НаКлиенте
Процедура Печать(Команда) Экспорт
	
	Если ОбщийКлиент.ПроверкаМодифицированности(ЭтаФорма,команда)=Ложь Тогда Возврат; КонецЕсли;
	
	ИмяКодМакета = СокрЛП(Команда.Имя);
	Если ИмяКодМакета = "ПечатьДефектовка" Тогда
		ПечатьДефектовка(Команда);Возврат;
	ИначеЕсли Объект.ДатаИспытания = Дата(1,1,1) Тогда
		ПоказатьПредупреждение(,"Не указана дата испытания");
		Возврат;
	КонецЕсли;
	
	Таб = ПечатныеФормыНаСервере(Объект.Ссылка,ИмяКодМакета,Объект.Контрагент);
	Если Таб = Неопределено Тогда Возврат; КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ФормаПечати",Новый Структура("Результат,Заголовок",Таб,ИмяКодМакета),,Новый УникальныйИдентификатор());
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЭтаФорма.ТолькоПросмотр = Истина;
	ЦенаСтрока = ""+Документы.ро_Реестры.ПолучитьЦенуИзПрайса(Объект.Дата,ОБъект.Контрагент,Объект.Оборудование)+" руб.";
КонецПроцедуры


&НаКлиенте
Процедура Разблокировать(Команда)
	ЭтаФорма.ТолькоПросмотр = Ложь;
	Элементы.ФормаРазблокировать.Видимость = Ложь;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ЗаполнитьДефектовкуНаСервере(ссобр)
	Возврат Справочники.ро_Оборудование.ПолучитьДеталиДефектовки(ссОбр.Родитель);
КонецФункции


&НаКлиенте
Процедура ЗаполнитьДефектовку(Команда)
	
	Если ОБъект.Дефектовка.Количество()<>0 Тогда
		оо = Новый ОписаниеОповещения("ЗаполнитьДефектовкуВопрос",этотОбъект);
		ПоказатьВопрос(оо,"Текущие строки дефектовки будут очищены. Продолжить?",РежимДиалогаВопрос.ДаНет);
	ИНАче
		ЗаполнитьДефектовкуАЛГА();
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДефектовкуВопрос(Рез,параметры) Экспорт
	Если Рез<>КодВозвратаДиалога.Да ТОгда Возврат; КонецеСЛИ;
	ЗаполнитьДефектовкуАЛГА();
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьДефектовкуАЛГА()
	Мас = ЗаполнитьДефектовкуНаСервере(Объект.Оборудование);
	
	ОБъект.Дефектовка.Очистить();
	Для каждого эл из МАс Цикл
		новСтр = объект.Дефектовка.Добавить();
		ЗаполнитьЗначенияСвойств(новстр,Эл);
	КонецЦИкла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылкаДефектГоден()
	Возврат Справочники.Дефекты.Годен;
КонецФункции

&НаКлиенте
Процедура ДефектовкаГоденПриИзменении(Элемент)
	
	Если СсылкаДефектГоден=Неопределено Тогда
		СсылкаДефектГоден = ПолучитьСсылкаДефектГоден();
	КонецЕсли;
	
	Стр = Элементы.Дефектовка.текущиеДанные;
	Стр.Годен = Истина;
	Стр.Реставрация = ложь;
	Стр.Изготовление = ложь;
	Стр.Покупка = ложь;
	Стр.Дефект = СсылкаДефектГоден;
	
КонецПроцедуры

&НаКлиенте
Процедура ДефектовкаНеГоденПриИзменении(Элемент)
	Если СсылкаДефектГоден=Неопределено Тогда
		СсылкаДефектГоден = ПолучитьСсылкаДефектГоден();
	КонецЕсли;
	
	имя = СтрЗаменить(Элемент.Имя,"Дефектовка","");
	
	Стр = Элементы.Дефектовка.текущиеДанные;
	Стр.Годен = ложь;
	Стр.Реставрация = ложь;
	Стр.Изготовление = ложь;
	Стр.Покупка = ложь;
	Стр[Имя] = Истина;
	
	Если Стр.Дефект = СсылкаДефектГоден Тогда
		Стр.Дефект = Неопределено;
	КонецЕСЛИ;
	
КонецПроцедуры

&НаКлиенте
Процедура ДефектовкаДефектыПриИзменении(Элемент)
	Если СсылкаДефектГоден=Неопределено Тогда
		СсылкаДефектГоден = ПолучитьСсылкаДефектГоден();
	КонецЕсли;
	
	Стр = Элементы.Дефектовка.текущиеДанные;
	Если Стр.Дефект = СсылкаДефектГоден Тогда
		ДефектовкаГоденПриИзменении(Элемент);
	ИНачеЕсли Стр.Годен = Истина Тогда
		ДефектовкаНеГоденПриИзменении(Новый Структура("Имя","Изготовление"));
	КонецЕСЛИ;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПечатьДефектовкаНаСервере(сс)
	Возврат Документы.роЗаказНаряд.ПечатьДефектовка(сс);
КонецФункции

&НаКлиенте
Процедура ПечатьДефектовка(Команда)
	
	Если ОбщийКлиент.ПроверкаМодифицированности(ЭтаФорма,команда)=Ложь Тогда Возврат; КонецЕсли;
	
	Если Объект.Дефектовка.Количество()=0 Тогда
		ЗаполнитьДефектовкуАЛГА();
		ЭтаФорма.Записать();
	КонецЕсли;
	
	Таб = ПечатьДефектовкаНаСервере(Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.ФормаПечати",Новый Структура("Результат,Заголовок",Таб,"Деф.вед."),,Новый УникальныйИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ВключитьВРеестр = Истина и Объект.ДатаИспытания=Дата(1,1,1) ТОгда
		Сообщить("Не указана дата испытания!");
		отказ = Истина;
	КонецЕСЛИ;
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВРеестрПриИзменении(Элемент)
		ЭтаФорма.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеКоррПриИзменении(Элемент)
	ОбновитьФорму();
КонецПроцедуры
